In [1]:
import pandas as pd
import numpy as np

In [2]:
my_data = np.array([[10,20,30],[20,30,40],[20,50,10],[10,15,20]])#nested liste dediğimiz liste içinde listeler

In [3]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [4]:
my_names = ["James","Lars","Kirk","Rob"]

In [5]:
my_columns = ["Jan","Feb","Mar"]

In [6]:
my_data_frame = pd.DataFrame(my_data)#dataFrame da alınan listeler üst üste dizilir satır ve sütunlar oluşturulur

In [7]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  20

In [8]:
type(my_data_frame)

pandas.core.frame.DataFrame

In [9]:
my_data_frame[1]#indexe göre 1. sütunu alır

0    20
1    30
2    50
3    15
Name: 1, dtype: int32

In [10]:
new_data_frame = pd.DataFrame(my_data, index=my_names, columns= my_columns)#index leri ve sütunları istediğmiz gibi isimlendirebiliyoruz,nested listemizde bizim veri setimiz oluyor

In [11]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [12]:
type(new_data_frame["Feb"])#her bir sutün pek ala seri olur

pandas.core.series.Series

In [13]:
new_data_frame["Feb"]#ilgili sutüna ait index ve değerrler alınır

James    20
Lars     30
Kirk     50
Rob      15
Name: Feb, dtype: int32

In [14]:
feb_series = new_data_frame["Feb"]#dataFrame dan seri çekebiliyoruz

In [15]:
feb_series.mean()#numpy da olduğu gibi tüm değerlerin ortalaması

28.75

In [16]:
feb_series.Lars#kişileri çekebiliyoruz

30

In [17]:
feb_series.Rob

15

In [18]:
feb_series.max()

50

In [19]:
new_data_frame["Jan"].mean()#hala sutünlar üzerinden işlem yapıyoruz,seriyi çekmeden ortalama

15.0

In [20]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [21]:
new_data_frame[["Jan","Feb"]]#sadece istediğimiz sütunlar

       Jan  Feb
James   10   20
Lars    20   30
Kirk    20   50
Rob     10   15

In [22]:
new_data_frame.loc["Lars"]#şimdi satır üzerinden işlem yapabilir hale geldik

Jan    20
Feb    30
Mar    40
Name: Lars, dtype: int32

In [23]:
type(new_data_frame.loc["Lars"])

pandas.core.series.Series

In [24]:
new_data_frame.loc["Rob"].mean()#robun satır üzerindeki ortalamaları

15.0

In [25]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [26]:
new_data_frame.iloc[3]#iloc ile index üzerinden istediğmiz elemanı alabildik

Jan    10
Feb    15
Mar    20
Name: Rob, dtype: int32

In [27]:
new_data_frame["Apr"] = new_data_frame["Mar"] * 2#yeni bir sütun daha önceki sutünların çarpımının iki katı yaparak ekledik

In [28]:
new_data_frame

       Jan  Feb  Mar  Apr
James   10   20   30   60
Lars    20   30   40   80
Kirk    20   50   10   20
Rob     10   15   20   40

In [29]:
new_data_frame.drop("Rob",axis=0)#axis 0 ise satır 1 ise stun demek oluyor,Robun satırını drop ile kaldırdık

       Jan  Feb  Mar  Apr
James   10   20   30   60
Lars    20   30   40   80
Kirk    20   50   10   20

In [30]:
new_data_frame

       Jan  Feb  Mar  Apr
James   10   20   30   60
Lars    20   30   40   80
Kirk    20   50   10   20
Rob     10   15   20   40

In [31]:
new_data_frame.drop("Apr",axis=1)#aynı mantıkla bu sefer sütunu,ancak yaptığımız değişiklikler asıl dataFrame de bir değişiklik yapmaz

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [32]:
new_data_frame

       Jan  Feb  Mar  Apr
James   10   20   30   60
Lars    20   30   40   80
Kirk    20   50   10   20
Rob     10   15   20   40

In [33]:
new_data_frame.drop("Apr",axis=1,inplace=True)#inplace sayesinde (true olması şartı ile),asıl dataFrame de değişiklik yapabildik

In [34]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [35]:
new_data_frame["Jan"]["Lars"]#sutün satır kesişimi

20

In [36]:
new_data_frame["Mar"]["James"]

30

In [37]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [38]:
boolean_frame = new_data_frame > 25#boolean da bir şey ya doğrudur ya da yanlış,burda dataFrame de ki değeri 25 den büyük sayılara true değeri atanır geri kalanlara false

In [39]:
boolean_frame

         Jan    Feb    Mar
James  False  False   True
Lars   False   True   True
Kirk   False   True  False
Rob    False  False  False

In [40]:
new_data_frame[boolean_frame]#doğru olan değerleri sayısal olarak görmek istersek

       Jan   Feb   Mar
James  NaN   NaN  30.0
Lars   NaN  30.0  40.0
Kirk   NaN  50.0   NaN
Rob    NaN   NaN   NaN

In [41]:
new_data_frame[new_data_frame > 30]

       Jan   Feb   Mar
James  NaN   NaN   NaN
Lars   NaN   NaN  40.0
Kirk   NaN  50.0   NaN
Rob    NaN   NaN   NaN

In [42]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [43]:
new_data_frame[new_data_frame["Mar"] > 25]#sutünda değeri 25 den büyük olmayan satırları almaz

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40

In [44]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [91]:
new_data_frame.reset_index()#0 da başlayan ek indeksler ekler

   index  Jan  Feb  Mar
0  James   10   20   30
1   Lars   20   30   40
2   Kirk   20   50   10
3    Rob   10   15   20

In [93]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [99]:
new_data_frame["NewIndex"] = ["Jam","Lar","Kir","Robert"]#yeni bir sütun altında yeni değerler ekleyebiliyoruz

In [101]:
new_data_frame

       Jan  Feb  Mar NewIndex
James   10   20   30      Jam
Lars    20   30   40      Lar
Kirk    20   50   10      Kir
Rob     10   15   20   Robert

In [103]:
new_data_frame.set_index("NewIndex")#ya da bunu asıl index yapabiliyoruz

          Jan  Feb  Mar
NewIndex
Jam        10   20   30
Lar        20   30   40
Kir        20   50   10
Robert     10   15   20

In [105]:
new_data_frame

       Jan  Feb  Mar NewIndex
James   10   20   30      Jam
Lars    20   30   40      Lar
Kirk    20   50   10      Kir
Rob     10   15   20   Robert

In [107]:
new_data_frame.drop("NewIndex",axis=1,inplace=True)

In [109]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20